/*******************************************************************************
*                 
*                 		       普中科技
--------------------------------------------------------------------------------
* 实 验 名		 : 红外遥控实验
* 实验说明       : 通过printf打印红外遥控键值数据 ，在串口助手上显示其
					地址码和操作码及其反码，不同的键对应不同的码
					见文件内截图 ，程序设计中所有中断函数都放在中断stm32f10x_it.c文件
* 连接方式       : 
* 注    意		 : 	所用函数在头文件.c文件内
*******************************************************************************/

#include "public.h"
#include "printf.h"
#include "hwjs.h"
#include "systick.h"

/****************************************************************************
* Function Name  : main
* Description    : Main program.
* Input          : None
* Output         : None
* Return         : None
****************************************************************************/
int main()
{	
   	hwjs_init();   //红外接口初始化
	printf_init();	//printf初始化
	while(1)
	{
		if(hw_jsbz==1)	//如果红外接收到
		{
			hw_jsbz=0;	   //清零
			printf("红外接收码 %0.8X\r\n",hw_jsm);	//打印
			hw_jsm=0;					//接收码清零
		}			
	}			
}



